; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v4 ?v5)
             (pred_5 ?v9 ?v3)
             (pred_2 ?v4 ?v3)
             (pred_3 ?v10 ?v4 )
	     (pred_11 ?v4)
             (pred_10 ?v11)
             (pred_7 ?v9)
             (pred_8 ?v3)
             (pred_1 ?v4)
             (pred_6 ?v9)
             (pred_9 ?v4)
             (pred_4 ))



(:action op_3
:parameters (?v13 ?v6 ?v2 ?v8)
:precondition (and (pred_10 ?v13) (pred_10 ?v6) (pred_7 ?v2) (pred_8 ?v8)
          (pred_12 ?v13 ?v6) (pred_5 ?v2 ?v8)
                   (pred_2 ?v6 ?v8) (pred_11 ?v13) 
                   (pred_1 ?v6) (pred_6 ?v2))
:effect (and  (pred_9 ?v6) (not (pred_1 ?v6))))


(:action op_4
:parameters (?v13 ?v7)
:precondition (and (pred_10 ?v13) (pred_10 ?v7)
               (pred_11 ?v13) (pred_12 ?v13 ?v7) (pred_9 ?v7))
:effect (and (pred_11 ?v7) (not (pred_11 ?v13))))

(:action op_5
:parameters (?v13 ?v2)
:precondition (and (pred_10 ?v13) (pred_7 ?v2) 
                  (pred_11 ?v13) (pred_3 ?v2 ?v13) (pred_4 ))
:effect (and (pred_6 ?v2)
   (not (pred_3 ?v2 ?v13)) (not (pred_4 ))))


(:action op_2
:parameters (?v13 ?v12 ?v1)
:precondition (and (pred_10 ?v13) (pred_7 ?v12) (pred_7 ?v1)
                  (pred_11 ?v13) (pred_6 ?v1) (pred_3 ?v12 ?v13))
:effect (and (pred_6 ?v12) (pred_3 ?v1 ?v13)
        (not (pred_6 ?v1)) (not (pred_3 ?v12 ?v13))))

(:action op_1
:parameters (?v13 ?v2)
:precondition (and (pred_10 ?v13) (pred_7 ?v2) 
                  (pred_11 ?v13) (pred_6 ?v2))
:effect (and (pred_4 ) (pred_3 ?v2 ?v13) (not (pred_6 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_30 obj_11 obj_12 obj_05 obj_29 obj_06 obj_25 obj_28 obj_13 obj_23 obj_18 obj_14 obj_24 obj_15 obj_22 obj_31 obj_03 obj_20 obj_19 obj_21 obj_09 obj_17 obj_01 obj_04
    obj_07 obj_10 obj_02
    obj_16 obj_08 obj_27
    )

    (:init
       (pred_4)

       (pred_10 obj_26)
       (pred_10 obj_30)
       (pred_10 obj_11)
       (pred_10 obj_12)
       (pred_10 obj_05)
       (pred_10 obj_29)
       (pred_10 obj_06)
       (pred_10 obj_25)
       (pred_10 obj_28)
       (pred_10 obj_13)
       (pred_10 obj_23)
       (pred_10 obj_18)
       (pred_10 obj_14)
       (pred_10 obj_24)
       (pred_10 obj_15)
       (pred_10 obj_22)
       (pred_10 obj_31)
       (pred_10 obj_03)
       (pred_10 obj_20)
       (pred_10 obj_19)
       (pred_10 obj_21)
       (pred_10 obj_09)
       (pred_10 obj_17)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_10)
       (pred_8 obj_02)
       (pred_7 obj_16)
       (pred_7 obj_08)
       (pred_7 obj_27)

       (pred_12 obj_26 obj_29)
       (pred_12 obj_26 obj_30)
       (pred_12 obj_30 obj_06)
       (pred_12 obj_30 obj_11)
       (pred_12 obj_30 obj_26)
       (pred_12 obj_11 obj_25)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_11 obj_30)
       (pred_12 obj_12 obj_28)
       (pred_12 obj_12 obj_05)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_29 obj_23)
       (pred_12 obj_29 obj_06)
       (pred_12 obj_29 obj_26)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_06 obj_25)
       (pred_12 obj_06 obj_30)
       (pred_12 obj_06 obj_29)
       (pred_12 obj_25 obj_14)
       (pred_12 obj_25 obj_28)
       (pred_12 obj_25 obj_11)
       (pred_12 obj_25 obj_06)
       (pred_12 obj_28 obj_24)
       (pred_12 obj_28 obj_13)
       (pred_12 obj_28 obj_12)
       (pred_12 obj_28 obj_25)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_28)
       (pred_12 obj_23 obj_22)
       (pred_12 obj_23 obj_18)
       (pred_12 obj_23 obj_29)
       (pred_12 obj_18 obj_31)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_06)
       (pred_12 obj_18 obj_23)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_24)
       (pred_12 obj_14 obj_25)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_24 obj_20)
       (pred_12 obj_24 obj_15)
       (pred_12 obj_24 obj_28)
       (pred_12 obj_24 obj_14)
       (pred_12 obj_15 obj_19)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_15 obj_24)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_22 obj_31)
       (pred_12 obj_22 obj_23)
       (pred_12 obj_31 obj_09)
       (pred_12 obj_31 obj_03)
       (pred_12 obj_31 obj_18)
       (pred_12 obj_31 obj_22)
       (pred_12 obj_03 obj_17)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_31)
       (pred_12 obj_20 obj_01)
       (pred_12 obj_20 obj_19)
       (pred_12 obj_20 obj_24)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_19 obj_04)
       (pred_12 obj_19 obj_15)
       (pred_12 obj_19 obj_20)
       (pred_12 obj_21 obj_09)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_09 obj_17)
       (pred_12 obj_09 obj_31)
       (pred_12 obj_09 obj_21)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_17 obj_03)
       (pred_12 obj_17 obj_09)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_01 obj_20)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_04 obj_19)
       (pred_12 obj_04 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_06)
       (pred_1 obj_26)
       (pred_2  obj_12 obj_07)
       (pred_2  obj_06 obj_10)
       (pred_2  obj_26 obj_02)
       (pred_9 obj_30)
       (pred_9 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_29)
       (pred_9 obj_25)
       (pred_9 obj_28)
       (pred_9 obj_13)
       (pred_9 obj_23)
       (pred_9 obj_18)
       (pred_9 obj_14)
       (pred_9 obj_24)
       (pred_9 obj_15)
       (pred_9 obj_22)
       (pred_9 obj_31)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_04)

       (pred_5  obj_16 obj_07)
       (pred_5  obj_08 obj_10)
       (pred_5  obj_27 obj_02)
       (pred_3 obj_16 obj_29)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_27 obj_12)
       (pred_11 obj_11)
    )

    (:goal (and
       (pred_3 obj_16 obj_20)
       (pred_3 obj_08 obj_23)
    ))
(:constraints
  (always (not (pred_11 obj_14)))
)
)

; plan
1. (op_4 obj_11 obj_25)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_25)
   goals met: 0 of 2
2. (op_4 obj_25 obj_28)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_28)
   goals met: 0 of 2
3. (op_4 obj_28 obj_24)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_24)
   goals met: 0 of 2
4. (op_4 obj_24 obj_20)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_20)
   goals met: 0 of 2
5. (op_4 obj_20 obj_03)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_03)
   goals met: 0 of 2
6. (op_4 obj_03 obj_31)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_31)
   goals met: 0 of 2
7. (op_4 obj_31 obj_22)
   deleted: (pred_11 obj_31)
   added: (pred_11 obj_22)
   goals met: 0 of 2
8. (op_5 obj_22 obj_08)
   deleted: (pred_3 obj_08 obj_22) (pred_4)
   added: (pred_6 obj_08)
   goals met: 0 of 2
9. (op_4 obj_22 obj_23)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_23)
   goals met: 0 of 2
10. (op_1 obj_23 obj_08)
   deleted: (pred_6 obj_08)
   added: (pred_4) (pred_3 obj_08 obj_23)
   goals met: 1 of 2
11. (op_4 obj_23 obj_29)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_29)
   goals met: 1 of 2
12. (op_5 obj_29 obj_16)
   deleted: (pred_3 obj_16 obj_29) (pred_4)
   added: (pred_6 obj_16)
   goals met: 1 of 2
13. (op_4 obj_29 obj_23)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_23)
   goals met: 1 of 2
14. (op_4 obj_23 obj_18)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_18)
   goals met: 1 of 2
15. (op_4 obj_18 obj_31)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_31)
   goals met: 1 of 2
16. (op_4 obj_31 obj_03)
   deleted: (pred_11 obj_31)
   added: (pred_11 obj_03)
   goals met: 1 of 2
17. (op_4 obj_03 obj_20)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_20)
   goals met: 1 of 2
18. (op_1 obj_20 obj_16)
   deleted: (pred_6 obj_16)
   added: (pred_4) (pred_3 obj_16 obj_20)
   goals met: 2 of 2
